WTCHEN2-Nick/TeachableMachine_Local_Studio/mcu_toolkit/NuML_TFLM_Tool/templates/M55M1/NuGestureAI-M55M1/imgclass_template/NN_ImgClassInference/Device/UVC/UVC.c
                        case UVC_STILL_VGA://640*480(3)
                            uvcInfo.VSStillCmdCtlData.dwMaxVideoFrameSize = UVC_SIZE_VGA;
                            break;
                    }

                    uvcStatus.snapshotFormatIndex = uvcInfo.VSStillCmdCtlData.bFormatIndex;
                    uvcStatus.snapshotFrameIndex = uvcInfo.VSStillCmdCtlData.bFrameIndex;
                    uvcStatus.snapshotMaxVideoFrameSize = uvcInfo.VSStillCmdCtlData.dwMaxPayloadTranferSize = uvcInfo.IsoMaxPacketSize[gAltInterface];
                    HSUSBD_PrepareCtrlIn((uint8_t *)&uvcInfo.VSStillCmdCtlData, gUsbCmd.wLength);
                    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
                }

            }
            else if (gUsbCmd.wValue == VS_STILL_IMAGE_TRIGGER_CONTROL)
            {
                if (gUsbCmd.bRequest == UVC_GET_INFO)
                    Data = 3;//Info
                else
                    Data = uvcStatus.StillImage;//Trigger

                HSUSBD_PrepareCtrlIn((uint8_t *)&Data, gUsbCmd.wLength);
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
            }
        }
        else if (NuML_CDC_ClassRequest())
        {
            /* Handled by the CDC function. */
        }
        else
        {
            /* Setup error, stall the device */
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
        }
    }
    else
    {
        /* Host to device */
        /* Video Probe Control Request */
        if (gUsbCmd.wIndex == 0x0500)
        {
            uint16_t OutValue = 0;

            if (gUsbCmd.bRequest == UVC_SET_CUR)
            {
                HSUSBD_CtrlOut((uint8_t *)&OutValue, gUsbCmd.wLength);
                UVC_PU_Control(OutValue);
                /* Status stage */
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            }
        }
        else if (gUsbCmd.wIndex == 0x0100)
        {
            uvcInfo.u8ErrCode = EC_Invalid_Request;
            /* Setup error, stall the device */
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
        }
        else if (gUsbCmd.wIndex == 0x0001)
        {
            if (gUsbCmd.wValue == VS_STILL_IMAGE_TRIGGER_CONTROL)
                HSUSBD_CtrlOut((uint8_t *)&uvcStatus.StillImage, gUsbCmd.wLength);
            else if ((gUsbCmd.wValue == VS_PROBE_CONTROL) || (gUsbCmd.wValue == VS_COMMIT_CONTROL))
                HSUSBD_CtrlOut((uint8_t *)&uvcInfo.VSCmdCtlData, gUsbCmd.wLength);
            else if ((gUsbCmd.wValue == VS_STILL_PROBE_CONTROL) || (gUsbCmd.wValue == VS_STILL_COMMIT_CONTROL))
                HSUSBD_CtrlOut((uint8_t *)&uvcInfo.VSStillCmdCtlData, gUsbCmd.wLength);

            /* Status stage */
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
        }
        else if (NuML_CDC_ClassRequest())
        {
            /* Handled by the CDC function. */
        }
        else
        {
            /* Setup error, stall the device */
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
        }
    }
}

/**
 * @brief       Set Interface standard request
 *
 * @param[in]   u32AltInterface Interface
 *
 * @return      None
 *
 * @details     This function is used to set UVC Class relative setting
 */
void UVC_SetInterface(uint32_t u32AltInterface)
{
    /* NuML_CDC_SETINTERFACE_GUARD: only the VideoStreaming interface
     * may drive gAppConnected.  Without this a CDC SET_INTERFACE would
     * silently stop the video stream. */
    if ((gUsbCmd.wIndex & 0xfful) != 0x01ul)
    {
        return;
    }

    gAltInterface = gAppConnected = u32AltInterface;

    if (gUsbCmd.wValue == 0)
    {
        g_hsusbd_DmaDone = 1;
        /* stop usbd dma and flush FIFO */
        HSUSBD_ResetDMA();
        HSUSBD->EP[EPA].EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
    }
}

uint32_t UVC_PU_Info(uint32_t Req, uint32_t Unit)
{
    uvcInfo.u8ErrCode = 0;

    switch (Req)
    {
        case UVC_GET_CUR:
            switch (Unit)
            {
                case PU_BACKLIGHT_COMPENSATION_CONTROL:
                    return uvcInfo.CapFilter.Backlight;

                case PU_BRIGHTNESS_CONTROL:
                    return uvcInfo.CapFilter.Brightness;

                case PU_CONTRAST_CONTROL:
                    return uvcInfo.CapFilter.Contrast;

                case PU_HUE_CONTROL:
                    return uvcInfo.CapFilter.Hue;

                case PU_SATURATION_CONTROL:
                    return uvcInfo.CapFilter.Saturation;

                case PU_SHARPNESS_CONTROL:
                    return uvcInfo.CapFilter.Sharpness;

                case PU_GAMMA_CONTROL:
                    return uvcInfo.CapFilter.Gamma;

                case PU_POWER_LINE_FREQUENCY_CONTROL:
                    return uvcInfo.CapFilter.POWER_LINE_FREQUENCY;

                default:
                    uvcInfo.u8ErrCode = EC_Invalid_Control;
                    return 6;
            }

        case UVC_GET_MIN:
            switch (Unit)
            {
                case PU_BACKLIGHT_COMPENSATION_CONTROL:
                    return uvcPuInfo.PU_BACKLIGHT_COMPENSATION_MIN;

                case PU_BRIGHTNESS_CONTROL:
                    return uvcPuInfo.PU_BRIGHTNESS_MIN;

                case PU_CONTRAST_CONTROL:
                    return uvcPuInfo.PU_CONTRAST_MIN;

                case PU_HUE_CONTROL:
                    return uvcPuInfo.PU_HUE_MIN;

                case PU_SATURATION_CONTROL:
                    return uvcPuInfo.PU_SATURATION_MIN;

                case PU_SHARPNESS_CONTROL:
                    return uvcPuInfo.PU_SHARPNESS_MIN;

                case PU_GAMMA_CONTROL:
                    return uvcPuInfo.PU_GAMMA_MIN;

                case PU_POWER_LINE_FREQUENCY_CONTROL:
                    return uvcPuInfo.PU_POWER_LINE_FREQUENCY_MIN;

                default:
                    uvcInfo.u8ErrCode = EC_Invalid_Control;
                    return 6;
            }

        case UVC_GET_MAX:
            switch (Unit)
            {
                case PU_BACKLIGHT_COMPENSATION_CONTROL:
                    return uvcPuInfo.PU_BACKLIGHT_COMPENSATION_MAX;

                case PU_BRIGHTNESS_CONTROL:
                    return uvcPuInfo.PU_BRIGHTNESS_MAX;

                case PU_CONTRAST_CONTROL:
                    return uvcPuInfo.PU_CONTRAST_MAX;

