WTCHEN2-Nick/TeachableMachine_Local_Studio/mcu_toolkit/NuML_TFLM_Tool/templates/M55M1/NuGestureAI-M55M1/imgclass_template/NN_ImgClassInference/Device/UVC/UVC.c
int32_t UVC_ActiveDMA(uint32_t u32Addr, uint32_t u32Len)
{
    if (gAppConnected == 0)
    {
        return -1;
    }

    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(u32Len);
    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();

    while (g_hsusbd_Configured)
    {
        if (g_hsusbd_DmaDone)
            break;

        if ((HSUSBD_IS_ATTACHED() == 0) || (gAppConnected == 0))
        {
            if (HSUSBD->DMACTL & 0x20)
            {
                HSUSBD_ResetDMA();
                HSUSBD->EP[EPA].EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
            }

            break;
        }
    }

    return 0;
}


void UVC_IsoIn(uint32_t u32Addr, uint32_t u32Len)
{
    uint32_t u32Loop, toggle = 0;
    uint32_t i, header;
    uint8_t *ptr;
    int32_t ret;

    if (uvcInfo.bChangeData == 1)
    {
        uvcInfo.bChangeData = 0;

        if (HSUSBD->DMACNT & 0x20)
        {
            HSUSBD_ResetDMA();
            uvcStatus.bReady = TRUE;
        }
    }

    /* iso in, dma read, epnum = 1 */
    HSUSBD_SET_DMA_READ(ISO_IN_EP_NUM);

    ptr = (uint8_t *)u32Addr;
    u32Loop = u32Len / USBD_MAX_DMA_LEN;

    for (i = 0; i < u32Loop; i++)
    {
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk | HSUSBD_EPINTEN_SHORTTXIEN_Msk);
        g_hsusbd_ShortPacket = 0;
        /* Start of Transfer Payload Data */
        header = ((g_u8UVC_PD | (g_u8UVC_FID & 0x01)) << 8) | 0x02;

        while (1)
        {
            if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
            {
                HSUSBD->EP[EPA].EPDAT_BYTE = header & 0xff;
                HSUSBD->EP[EPA].EPDAT_BYTE = (header >> 8) & 0xff;

                if (toggle)
                {
                    HSUSBD->EP[EPA].EPDAT_BYTE = *ptr & 0xff;
                    HSUSBD->EP[EPA].EPDAT_BYTE = *(ptr + 1) & 0xff;

                    ret = UVC_ActiveDMA((uint32_t)(ptr + 2), USBD_MAX_DMA_LEN - 2);
                }
                else
                {
                    ret = UVC_ActiveDMA((uint32_t)ptr, USBD_MAX_DMA_LEN);
                }

                if (ret != 0)
                    return;

                toggle ^= 1;
                ptr += USBD_MAX_DMA_LEN;
                break;
            }
        }
    }

    u32Loop = u32Len % USBD_MAX_DMA_LEN;

    if (u32Loop)
    {
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk | HSUSBD_EPINTEN_SHORTTXIEN_Msk);
        g_hsusbd_ShortPacket = 1;
        header = ((g_u8UVC_PD | UVC_PH_EndOfFrame | (g_u8UVC_FID & 0x01)) << 8) | 0x02; //End Of Frame

        while (1)
        {
            if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
            {
                HSUSBD->EP[EPA].EPDAT_BYTE = header & 0xff;
                HSUSBD->EP[EPA].EPDAT_BYTE = (header >> 8) & 0xff;

                if (toggle)
                {
                    HSUSBD->EP[EPA].EPDAT_BYTE = *ptr & 0xff;
                    HSUSBD->EP[EPA].EPDAT_BYTE = *(ptr + 1) & 0xff;

                    ret = UVC_ActiveDMA((uint32_t)(ptr + 2), u32Loop - 2);
                }
                else
                {
                    ret = UVC_ActiveDMA((uint32_t)ptr, u32Loop);
                }

                if (ret != 0)
                    return;

                g_u8UVC_FID++;
                break;
            }
        }
    }
}

int UVC_SendImage(uint32_t u32Addr, uint32_t u32transferSize, uint32_t bStillImage)
{
    if (u32transferSize != 0)
    {
        //printf("send: 0x%x, %d (%d)\n", u32Addr, u32transferSize, bStillImage);
        uvcStatus.bReady = 0;

        HSUSBD->EP[EPA].EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
        HSUSBD_ResetDMA();

        if (bStillImage)
        {
            g_u8UVC_PD = UVC_PH_Snapshot;       /* Payload Header for Snapshot */
            uvcStatus.StillImage = 0;
        }
        else
            g_u8UVC_PD = UVC_PH_Preview;        /* Payload Header for Preview */

        UVC_IsoIn(u32Addr, u32transferSize);

        return 1;
    }

    return 0;
}

bool UVC_IsConnect(void)
{
    if ((gAppConnected) && (HSUSBD_IS_ATTACHED()))
        return TRUE;
    return FALSE;
}

